//Напишите программу, которая на вход
//принимает число и выдает его квадрат (
//умноженное на само себя).

int num = 5;
//int numResult = num * num;
double numResult = Math.Pow(num, 5);
Console.WriteLine(numResult); 